let Reviews=[
    {
        id:6,
        senderName:'Мария Витальевна',
        topic:"новости",
        senderText:'"Никаких "жестких гарантий" со стороны НАТО об отказе передавать США данные, полученные союзниками США по альянсу <…>, разумеется, не будет. Зато можно твердо рассчитывать на то, что эти данные будут сразу же передаваться Вашингтону. Это — гарантировано", — написал он в',
        date:"22 sep 2020",
        img:3,
        isNew:true,
        title:'Пушков прокомментировал выход США из Договора по открытому небу'
    },
    {
        id:1,
        senderName:'Виктория Викторовна',
        topic:"наука",
        
        senderText:'Гамма-аминомасляная кислота (ГАМК) — одно из веществ, участвующих в передаче сигналов между нервными клетками. Помимо этого, ГАМК влияет на развитие нервной системы. У взрослых млекопитающих это соединение тормозит образование нейронов, воздействуя, в частности, на ГАМКB-рецепторы. Эксперименты на актинии Nematostella vectensis, животном с гораздо более простой нервной системой, показали, что в случае стрекающих это тоже верно.',
        date:"28 oct 2020",
        img:3,
        isNew:false,
        title:'Один и тот же нейромедиатор тормозит образование нервных клеток и у млекопитающих, и у актиний'
        
    },
    {
        id:2,
        senderName:'Александр Михаилович',
        topic:"спорт",
        senderText:"«Да, это конец династии. Безусловно, Стеф Карри может выиграть ещё один чемпионат даже с Дрэймондом Грином. Потому что у «Голден Стэйт» есть прекрасный хозяин в Лейкобе, который готов потратить сотни миллионов долларов на налог на роскошь.Боб Майерс был великим гроссмейстером, просто посмотрите, что сделали «Уорриорз» ещё до того, как они подписали контракт с Кевином Дюрантом. В одиночку Стеф Карри и Клэй Томпсон так и не стали бы лучшими. Дрэймонд Грин был выбран во втором раунде.Подробнее на «Чемпионате»:",
        date:"13 nov 2020",
        img:3,
        isNew:true,
        title:'Голден Стэйт'
    },{
        id:3,
        senderName:'Иванов Иван',
        topic:"новости",
        senderText:'МОСКВА, 22 ноября / Радио Sputnik. Список получателей сведений от пресс-пула демократа Джо Байдена пришлось временно перевести в режим модерации, поскольку в воскресенье по предназначенной для журналистов рассылке был направлен спам, передает РИА Новости со ссылкой на заявление члена пула, репортера Associated Press Зика Миллера.',
        date:"15 mar  2020",
        img:1,
        isNew:false,
        title:'К черту Трампа". Пресс-пул Байдена распространил ругательный спам'
        
    },{
        id:4,
        senderName:'Виктор Викторович',
        topic:"спорт",
        senderText:'«Мы забили три мяча и не пропустили ни одного, мы исключительно хорошо защищались, контролировали игру, было много хороших моментов, я не могу выбрать один, который меня больше всего порадовал — может быть, выступление Джеймса Милнера на правом фланге. Он провёл исключительную игру, сначала на той позиции, а затем в центре полПодробнее на «Чемпионате»',
        date:"2 may 2020",
        img:2,
        isNew:true,
        title:'Джеймс Милнер'
    },  {
        id:5,
        senderName:'Валерия Валерьевна',
        topic:"наука",
        senderText:'аким было начало эволюции эукариотической клетки? На этот вопрос ответить непросто, так как мы не знаем никаких промежуточных форм, существовавших на ранних этапах развития эукариот от прокариотического предка. Однако определенные сведения об этих древнейших этапах можно получить, анализируя и сравнивая геномы современных эукариот и прокариот. Международная группа генетиков решала эту задачу, выбрав для изучения только консервативные семейства белков и соответствующие им гены. Выделив процессы наследования, дупликации и новообразования, ученые обрисовали вероятный сценарий становления эукариот. Асгардархейный предок, гены которого чаще других ',
        date:"17 sep 2020",
        img:1,
        isNew:false,
        title:'История дупликаций консервативных генов уточняет начальные этапы эволюции эукариот'
    }, {
        id:7,
        senderName:'Анастасия Викторвна',
        topic:"наука",
        senderText:'сем известно, что жемчуг формируется в раковинах моллюсков. Как правило, он вырастает в раковинах морских и пресноводных двустворок, но встречается и у гастропод. Также жемчуг был обнаружен у современных и ископаемых головоногих — наутилусов и аммонитов. Но всех этих моллюсков, несмотря на крайне отдаленное родство друг с другом, объединяет одна общая черта — их раковины являются наружными по отношению к телу. Мягкие ткани этих моллюсков находятся внутри раковин, и жемчуг растет именно в их раковинах — либо внутри тела моллюска, либо на внутренней поверхности раковины. У представителей подкласса Coleoidea из класса головоногих моллюсков,',
        date:"13 oct 2020",
        img:2,
        isNew:false,
        title:'Белемниты пополнили список жемчугоносных моллюсков'
    }, {
        id:8,
        senderName:'Василий Витальевич',
        topic:"спорт",
        senderText:'Это сложная ситуация, и когда Наби Кейта получает мышечную травму, вы понимаете, что проблем не станет меньше. Молодые игроки знают, когда им разрешают тренироваться с основой, значит, у них есть необходимые качества, чтобы помочь нам, мы не даём шансы просто так. Это тяжёлая школа с множеством шагов.Подробнее на «Чемпионате»',
        date:"22 nov 2020",
        img:1,
        isNew:true,
        title:'Наби Кейта'
    }, {
        id:9,
        senderName:'Александр Владимирович',
        topic:"новости",
        senderText:'АНКАРА, 22 ноя – РИА Новости. Столетие прибытия в Турцию из Крыма десятков тысяч бойцов армии генерала Врангеля отметили в Гелиболу в турецкой провинции Чанаккале, сообщил РИА Новости глава Центра российско-турецких исследований университета Онсекиз Март города Чанаккале Ведат Чалышкан.',
        date:"28 sep 2020",
        img:2,
        isNew:false,
        title:'В Турции отметили столетие исхода белогвардейцев из Крыма'
    }
    
    
]
export default function AddPost(state=Reviews,action){
    
            
    switch(action.type){
            case"addPost":
            return [...state,{...action.payload,id:Reviews.length+1,img:3}];

            case"clear":
            ////возвращаю  в первоначальное состояние после выхода их аккаунта
            
            return Reviews;
    
            
        default:return state
    }
}